Documents/ЗаявлениеОСпособеВыплатыЗарплатыКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявлениеОСпособеВыплатыЗарплатыКабинетСотрудника</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭлектронногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтменяемойЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтменяемогоЭлектронногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантИсправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИсправленияЗаявокКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменяемаяЗаявка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗаявкаКабинетСотрудника</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовИнтеграцияУправлениеПерсоналом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявокКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветПоЗаявке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БанковскиеСчетаФизическихЛиц</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыполненияЗаявокКабинетСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/РезультатыВыполненияЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияЗаявокКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявлениеОСпособеВыплатыЗарплатыКабинетСотрудника/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ЗаявкиСотрудниковФормы.ПриСозданииНаСервере(ЭтотОбъект, ОписаниеДокумента());
	ИнициализацияФормы();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаявкиСотрудниковФормы.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, ОписаниеДокумента());
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, ПараметрОповещения, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, ПараметрОповещения) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	ЗаявкиСотрудниковФормыКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, ПараметрОповещения, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_УдалитьДокументПоЗаявке(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаявкиСотрудниковФормыКлиент.УдалитьДокументПоЗаявке(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьБанковскийСчетЗаявкиПояснениеНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(СуществующийБанковскийСчет) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Банк, НомерСчета, Владелец");
	Отбор.Банк 			= РеквизитыБанка.Ссылка;
	Отбор.НомерСчета 	= Объект.НомерСчета;
	Отбор.Владелец 		= Объект.ФизическоеЛицо;
	
	ПараметрыФормы = Новый Структура("РежимВыбора, Отбор", Истина, Отбор);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьБанковскийСчетЗавершение", ЭтотОбъект);
	
	ЗаявкиСотрудниковФормыКлиент.ОткрытьФормуВыбораБанковскогоСчета(ПараметрыФормы, ЭтотОбъект, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУдалитьБанковскийСчетНажатие(Элемент)
	
	ЗаголовокВопроса = НСтр("ru = 'Подтверждение'");
	ТекстВопроса = НСтр("ru = 'банковский счет будет исключен из заявления'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьБанковскийСчетЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, ИнтеграцияУправлениеПерсоналомКлиента.ОписаниеКнопокВопроса(),,, ЗаголовокВопроса);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиПодключаемыхКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ЗаявкаВыполнена(Команда)
	
	РезультатВыполненияЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена");
	ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаОтклонена(Команда)
	
	РезультатВыполненияЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Отклонена");
	ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТиповойОтвет(Команда)
	
	ЗаявкиСотрудниковФормыКлиент.ВыбратьТиповойОтвет(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСрокИсполнения(Команда)
	
	ЗаявкиСотрудниковФормыКлиент.ИзменитьСрокИсполнения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБанковскийСчет(Команда)
	
	Банк		= ?(РеквизитыБанка = Неопределено, Неопределено, РеквизитыБанка.Ссылка);
	НомерСчета	= Объект.НомерСчета;
	Владелец	= Объект.ФизическоеЛицо;
	
	СуществующийБанковскийСчет = БанковскийСчет(Банк, НомерСчета, Владелец);
	Если Не ЗначениеЗаполнено(СуществующийБанковскийСчет) Тогда
		ПараметрыЗаполнения = Новый Структура("Банк, НомерСчета, Владелец", Банк, НомерСчета, Владелец);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", СуществующийБанковскийСчет);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьБанковскийСчетЗавершение", ЭтотОбъект);
	
	ЗаявкиСотрудниковФормыКлиент.ОткрытьФормуБанковскогоСчета(ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСпособВыплатыЗарплаты(Команда)
	
	ПараметрыФормы = Новый Структура("Ключ", Объект.Сотрудник);
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьСпособВыплатыЗарплатыЗавершение", ЭтотОбъект);
	ФормаСотрудника = ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,, ОписаниеОповещения);
	
	СотрудникиКлиент.ОткрытьДополнительнуюФорму(
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы("Справочник.Сотрудники.Форма.ВыплатаЗарплаты"),
		ФормаСотрудника,
		Истина,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиПодсистем

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ЗавершениеЗаявки

&НаКлиенте
Процедура ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки)
	
	Если ЗаявкаГотоваКВыполнению(РезультатВыполненияЗаявки) Тогда
		ЗаявкиСотрудниковФормыКлиент.НачатьВыполнениеКомандыЗаявкаВыполнена(ЭтаФорма, РезультатВыполненияЗаявки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РезультатЗаписиВыполненияЗаявки(РезультатВыполненияЗаявки) Экспорт
	
	Возврат РезультатЗаписиВыполненияЗаявкиНаСервере(РезультатВыполненияЗаявки);
	
КонецФункции

&НаСервере
Функция РезультатЗаписиВыполненияЗаявкиНаСервере(РезультатВыполненияЗаявки) Экспорт
	
	Возврат ЗаявкиСотрудников.РезультатЗаписиВыполненияЗаявки(ЭтаФорма, РезультатВыполненияЗаявки, ОписаниеДокумента());
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗавершенияЗаписиВыполненияЗаявки(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаявкиСотрудниковФормыКлиент.ОбработчикЗавершенияЗаписиВыполненияЗаявки(Результат, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция ЗаявкаГотоваКВыполнению(РезультатВыполненияЗаявки)
	
	Если РезультатВыполненияЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена") Тогда
		
		Если РезультатВыполненияСвязаннойЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Отклонена") Тогда
			ПоказатьПредупреждение(, СообщениеСвязаннаяЗаявкаОтклонена);
			Возврат Ложь;
		КонецЕсли;
		
		Если Объект.ТипОбъекта <> ПредопределенноеЗначение("Перечисление.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ОтменаЗаявки") Тогда
			Если ДоступенРасширенныйФункционал И Не ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
				
				ТекстОшибки = НСтр("ru = 'Отсутствует выбранный банковский счет, создайте новый или выберите существующий'");
				ТекстСообщения = НСтр("ru = 'Не выполнены все действия по заявке.'");
				ТекстПредупреждения = СтрШаблон("%1%2%3", ТекстСообщения, Символы.ПС, ТекстОшибки);
				ИнформированиеПользователяКлиент.Предупредить(ТекстПредупреждения);
				Возврат Ложь;
				
			КонецЕсли;
			
			Если ДоступенРасширенныйФункционал
				И Не СпособВыплатыЗарплатыЗаполнен(Объект.Сотрудник, Объект.БанковскийСчет) Тогда
				
				ТекстОшибки = НСтр("ru = 'У сотрудника не указан выбранный банковский счет в качестве места выплаты зарплаты.'");
				ПодробноеПредставлениеОшибки =
					НСтр("ru = 'У сотрудника не указан выбранный банковский счет в качестве места выплаты зарплаты.
					|Измените способ выплаты зарплаты, указав созданный банковский счет.'");
				ТекстСообщения = НСтр("ru = 'Не выполнены все действия по заявке.'");
				ТекстПредупреждения = СтрШаблон("%1%2%3", ТекстСообщения, Символы.ПС, ТекстОшибки);
				ИнформированиеПользователяКлиент.Предупредить(ТекстПредупреждения, ПодробноеПредставлениеОшибки);
				Возврат Ложь;
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли РезультатВыполненияЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Отклонена") Тогда
		
		Если РезультатВыполненияСвязаннойЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена") Тогда
			ПоказатьПредупреждение(, СообщениеСвязаннаяЗаявкаВыполнена);
			Возврат Ложь;
		КонецЕсли;
		
		Если ПустаяСтрока(Объект.ОтветПоЗаявке) Тогда
			ТекстСообщения = НСтр("ru = 'Необходимо указать причину, по которой заявка отклоняется.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ОтветПоЗаявке", "Объект");
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция СпособВыплатыЗарплатыЗаполнен(Сотрудник, БанковскийСчет)
	
	Возврат ЗаявкиСотрудников.СпособВыплатыЗарплатыЧерезБанкЗаполнен(Сотрудник, БанковскийСчет);
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработатьЗаписьСвязаннойЗаявки

&НаКлиенте
Процедура ОбработатьЗаписьСвязаннойЗаявки() Экспорт
	
	ОбработатьЗаписьСвязаннойЗаявкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписьСвязаннойЗаявкиНаСервере()
	
	ОписаниеДокумента = ОписаниеДокумента();
	ЗаявкиСотрудниковФормы.ПрочитатьВывестиСвязанныеЗаявки(ЭтаФорма, Объект, ОписаниеДокумента);
	ЗаявкиСотрудниковФормы.УстановитьДоступностьВыполненияПоСвязаннымЗаявкам(ЭтаФорма,ОписаниеДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаЗаписиОтменяющейЗаявки

&НаКлиенте
Процедура ОбработатьЗаписьОтменяющейЗаявки() Экспорт

	ОбработатьЗаписьОтменяющейЗаявкиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписьОтменяющейЗаявкиНаСервере()
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаДанныхЗаявления

&НаСервере
Процедура ПроверкаДанныхЗаявления()
	
	ЦветАвто = Новый Цвет;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиНомераСчета",
		"Видимость", Ложь);
	
	РеквизитыБанка = ПолучитьБанкПоБИКу(Объект.БИК);
	Если РеквизитыБанка = Неопределено Тогда
		
		ЦветТекстаПроверкиБанка	= ЦветСтиляПоясняющийОшибкуТекст;
		ЗаголовокПроверкиБанка	= НСтр("ru = 'Не найден в классификаторе банков'");
		
	ИначеЕсли РеквизитыБанка.ДеятельностьПрекращена Тогда
		
		ЦветТекстаПроверкиБанка	= ЦветСтиляПоясняющийОшибкуТекст;
		ЗаголовокПроверкиБанка	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Деятельность банка %1 прекращена'"),
									РеквизитыБанка.Наименование);
		
	Иначе
		
		ЦветТекстаПроверкиБанка	= ЦветСтиляИнформационнойНадписи;
		ЗаголовокПроверкиБанка	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = '%1'"),
									РеквизитыБанка.Наименование);
		
		РезультатПроверки = ПроверкиБЗККлиентСервер.РезультатПроверкиНомераСчета(
			Объект.НомерСчета,
			Объект.БИК,
			РеквизитыБанка.КоррСчет);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиНомераСчета",
			"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиНомераСчета",
			"Заголовок", РезультатПроверки.Пояснение);
		
		Если РезультатПроверки.Успех Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиНомераСчета",
				"ЦветТекста", ЦветСтиляИнформационнойНадписи);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиНомераСчета",
				"ЦветТекста", ЦветСтиляПоясняющийОшибкуТекст);
		КонецЕсли;
		
		СуществующийБанковскийСчет = БанковскийСчет(РеквизитыБанка.Ссылка, Объект.НомерСчета, Объект.ФизическоеЛицо);
		БанковскийСчетСуществует = ЗначениеЗаполнено(СуществующийБанковскийСчет);
		Если БанковскийСчетСуществует Тогда
			ТекстЗаголовка = НСтр("ru = 'Банковский счет уже создан, нажмите здесь, чтобы выбрать'");
			ЦветНадписиПояснения = ЦветСтиляИнформационнойНадписи;
		Иначе
			ТекстЗаголовка = НСтр("ru = '<банковский счет не создан>'");
			ЦветНадписиПояснения = ЦветСтиляПоясняющийТекст;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
			"Заголовок", ТекстЗаголовка);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
			"Гиперссылка", БанковскийСчетСуществует);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
			"ЦветТекста", ЦветНадписиПояснения);
		
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиБанка",
		"ЦветТекста", ЦветТекстаПроверкиБанка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиБанка",
		"Заголовок", ЗаголовокПроверкиБанка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьБанковскийСчет()
	
	Если Не ЗначениеЗаполнено(СуществующийБанковскийСчет) Тогда
		Если РеквизитыБанка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		СуществующийБанковскийСчет = БанковскийСчет(РеквизитыБанка.Ссылка, Объект.НомерСчета, Объект.ФизическоеЛицо);
	КонецЕсли;
	
	БанковскийСчетСуществует = ЗначениеЗаполнено(СуществующийБанковскийСчет);
	Если БанковскийСчетСуществует Тогда
		ТекстЗаголовка = НСтр("ru = 'Банковский счет уже создан, нажмите здесь, чтобы выбрать'");
		ЦветНадписиПояснения = ЦветСтиляИнформационнойНадписи;
	Иначе
		ТекстЗаголовка = НСтр("ru = '<банковский счет не создан>'");
		ЦветНадписиПояснения = ЦветСтиляПоясняющийТекст;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
		"Заголовок", ТекстЗаголовка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
		"Гиперссылка", БанковскийСчетСуществует);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
		"ЦветТекста", ЦветНадписиПояснения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБанкПоБИКу(БИК)
	
	НайденныйБанк = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(БИК) Тогда
		Возврат НайденныйБанк;
	КонецЕсли;
	
	СведенияБИК = РаботаСБанками.СведенияБИК(БИК);
	Если Не ЗначениеЗаполнено(СведенияБИК) Тогда
		Возврат НайденныйБанк;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СведенияБИК[0]);
	
КонецФункции

&НаСервереБезКонтекста
Функция БанковскийСчет(Банк, НомерСчета, Владелец)
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(Банк) Или Не ЗначениеЗаполнено(НомерСчета) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат ЗаявкиСотрудников.БанковскийСчетФизическогоЛица(Банк, НомерСчета, Владелец);
	
КонецФункции

&НаКлиенте
Процедура СоздатьБанковскийСчетЗавершение(СозданныйБанковскийСчет, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(СозданныйБанковскийСчет) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьБанковскийСчет(СозданныйБанковскийСчет);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСпособВыплатыЗарплатыЗавершение(Параметры, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьБанковскийСчет();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаБанковскогоСчета

&НаКлиенте
Процедура ВыбратьБанковскийСчетЗавершение(ВыбранныйБанковскийСчет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйБанковскийСчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьБанковскийСчет(ВыбранныйБанковскийСчет);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьБанковскийСчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьБанковскийСчет();
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБанковскийСчет(БанковскийСчетДляДобавления)
	
	Объект.БанковскийСчет = БанковскийСчетДляДобавления;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
		"Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБанковскийСчет",
		"Видимость", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьБанковскийСчет()
	
	Объект.БанковскийСчет = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
		"Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
		"Доступность", Не ТолькоПросмотр);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБанковскийСчет",
		"Видимость", Ложь);
	
	ЗаполнитьБанковскийСчет();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИнициализацияФормы()
	
	ЦветСтиляПоясняющийОшибкуТекст	= ЦветаСтиля.ПоясняющийОшибкуТекст;
	ЦветСтиляИнформационнойНадписи	= ЦветаСтиля.ТекстИнформационнойНадписи;
	ЦветСтиляПоясняющийТекст		= ЦветаСтиля.ПоясняющийТекст;
	
	ДоступенРасширенныйФункционал = ИнтеграцияУправлениеПерсоналом.ДоступенРасширенныйФункционал();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиБанка",
		"Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиНомераСчета",
		"Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДокументыПоЗаявкеГлавная",
		"Видимость", ДоступенРасширенныйФункционал);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБанковскийСчет",
		"Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
		"Видимость", Ложь);
	
	ТекстПояснения = НСтр("ru = 'Выполнение заявки недоступно. Необходимо выполнить или отклонить отменяющую заявку.'");
	
	Если Объект.ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ОтменаЗаявки Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДокументыПоЗаявкеГлавная",
			"Видимость", Ложь);
		
		ТекстПояснения = СтрШаблон("%1 %2",
			НСтр("ru = 'Заявку можно отметить как выполненную.'"),
			НСтр("ru = 'Для отклонения заявки необходимо указать причину в ""Сообщении сотруднику"".'"));
	ИначеЕсли Не ЗначениеЗаполнено(ОтменяющаяЗаявка) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиБанка",
			"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПроверкиНомераСчета",
			"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
			"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
		"Доступность", Не ТолькоПросмотр);
		
		ТекстПояснения = УстановитьТекстПоясненияПорядкаВыполнения();
		
		ПроверкаДанныхЗаявления();
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДокументыПоЗаявкеГлавная",
			"Доступность", Ложь);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияВыполнениеПояснение",
		"Заголовок", ТекстПояснения);
	
	Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьБанковскийСчетЗаявкиПояснение",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБанковскийСчет",
			"Видимость", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьТекстПоясненияПорядкаВыполнения()
	
	ТекстПояснения = СтрШаблон("%1 %2 %3 %4",
		НСтр("ru = 'Для выполнения заявки необходимо проверить существование данного филиала банка по БИК, корректность номера счёта,'"),
		НСтр("ru = 'создать банковский счёт и изменить способ выплаты зарплаты у сотрудника,'"),
		НСтр("ru = 'после этого заявку можно отметить как выполненную.'"),
		НСтр("ru = 'Для отклонения заявки необходимо указать причину в ""Сообщении сотруднику"".'"));
	
	Возврат ТекстПояснения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеДокумента()
	
	Описание = ЗаявкиСотрудниковКлиентСервер.НовоеОписаниеДокументаЗаявки();
	Описание.ПроверятьСвязанныеЗаявки 	= Истина;
	Описание.ДоступнаОтменаЗаявки 		= Истина;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
